{
    "course_name": "High Performance Computing (MSc) (Full-time)",
    "course_code": "PTMSCHPCMP1F",
    "year": "2023/24",
    "diet_note": "Students should meet with a member of the EPCC Student Support Team to discuss their course choices. The EPCC Student Support Team are able to provide guidance and support to students for course selections.\n\nAll optional course choices are subject to students meeting (and demonstrating that they meet/will meet) the prerequisite requirements of courses they wish to take. Course choices must be approved by a member of the EPCC Student Support Team (student.support@epcc.ed.ac.uk or your Personal Tutor).\n\nStudents are strongly recommended to balance their credit-load evenly between Semester 1 and Semester 2 (n.b. although INFR11173 Project Preparation takes place over two Semesters the workload is almost entirely located within Semester 2). It would be very uncommon for the EPCC Student Support Team to approve an imbalanced creditload split: Semester 1's courses are very important for building a solid foundation in the core concepts underpinning the programmes and Semester 2's courses generally contain more advanced material building on those foundations.\n\nProgramme-specific progression requirements require students to pass (at the 50% level) at least three of the following courses: EPCC11002 - Message-passing Programming, EPCC11003 - Threaded Programming, EPCC11004 - HPC Architectures, EPCC11010 - Parallel Design Patterns, EPCC11012 - Advanced Message-passing Programming, EPCC11011 - Advanced Parallel Techniques.\n\nConcessions to the Degree Programme Table may be possible, e.g. to take a specific course not listed below due to specific interests or if the learning outcomes of a compulsory course have already been met via prior learning, and will be judged on a case-by-case basis. A concession to the DPT cannot be guaranteed in advance.",
    "compulsory_courses": {
        "1": "EPCC11002",
        "2": "EPCC11003",
        "3": "EPCC11001",
        "4": "EPCC11008",
        "5": "EPCC11004",
        "6": "INFR11166"
    },
    "compulsory_courses_total_credit": 120,
    "optional_courses_total_credit": 60,
    "optional_courses": {
        "1": {
            "course_type": "EPCC HPC Optional Courses",
            "course_note": "",
            "credit_range": {
                "min_credit": 40,
                "max_credit": 60
            },
            "courses": {
                "1": "EPCC11006",
                "2": "EPCC11007",
                "3": "EPCC11009",
                "4": "EPCC11010",
                "5": "EPCC11011",
                "6": "EPCC11012"
            }
        },
        "2": {
            "course_type": "HPC Optional Data and Outside courses",
            "course_note": "N.b. some of these courses are run outwith EPCC, thus year-to-year availability cannot be guaranteed, nor can timetabling suitability or workload fits. We recommend discussing this with the EPCC Student Support Team before selecting such courses.  Students have responsibility to check prerequisite requirements for courses to ensure they meet the requirements. If in doubt please discuss with the EPCC Student Support Team.",
            "credit_range": {
                "min_credit": 0,
                "max_credit": 20
            },
            "courses": {
                "1": "EPCC11005",
                "2": "EPCC11013",
                "3": "EPCC11014",
                "4": "INFR11088",
                "5": "INFR11099"
            }
        }
    },
    "optional_courses_levls": {}
}