{
    "course_name": "Advanced Design Informatics (MSc) (Full-time)",
    "course_code": "PTMSCADEIN1F",
    "year": "2023/24",
    "diet_note": "Before making your course choices make sure you have discussed them with your Student Adviser, or someone in your student support team.\n\nStudents are not allowed to take any full year courses in Year 2, only courses that are restricted to Semester 1. They are also not allowed to take courses that are examined in May, such as Informatics Research Review INFR11136 (IRR).\n\nThe Masters Dissertation (Design Informatics) is completed in Semester 2, allowing those eligible students to graduate in the summer.",
    "compulsory_courses": {
        "1": "INFR11095",
        "2": "INFR11097"
    },
    "compulsory_courses_total_credit": 80,
    "optional_courses_total_credit": 40,
    "optional_courses": {},
    "optional_courses_levls": {
        "1": {
            "course_type": "Level 11 courses in Schedules A to Q, T, W and Y",
            "course_note": "These are courses in all Schools other than Medicine, Veterinary Studies, or the Centre for Open Learning. Note this includes courses within the School of Informatics.  Students may not register for introductory programming courses in other parts of the University unless explicitly listed in the DPT.",
            "credit_range": {
                "min_credit": 0,
                "max_credit": 40
            }
        },
        "2": {
            "course_type": "Level 10 courses in the School of Informatics",
            "course_note": "These are Level 10 courses available in the School of Informatics.",
            "credit_range": {
                "min_credit": 0,
                "max_credit": 20
            }
        },
        "3": {
            "course_type": "Level 10 courses in Edinburgh College of Art",
            "course_note": "These are Level 10 courses available in the Edinburgh College of Art.  Students may not register for introductory programming courses in other parts of the University unless explicitly listed in the DPT.",
            "credit_range": {
                "min_credit": 0,
                "max_credit": 20
            }
        }
    }
}